---
kind: property
id: P:Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUserAddinsLocation
source: html/df98bce4-9d9e-69fd-dc86-6071ca44ee92.htm
---
# Autodesk.Revit.ApplicationServices.ControlledApplication.CurrentUserAddinsLocation Property

The folder location for .addin files for the current user.

## Syntax (C#)
```csharp
public string CurrentUserAddinsLocation { get; }
```